# Вопросы и варианты ответов
QUESTIONS = [
    {
        'text': 'Вопрос 1: Как вы справляетесь с проблемой на работе?',
        'options': [
            'Ищу помощи у кого-то более опытного',
            'Стараюсь уйти от проблемы, возможно, сменить обстановку',
            'Устраиваю неожиданный перерыв или делаю что-то необычное, чтобы подойти к проблеме с другой стороны',
            'Управляю ситуацией так, чтобы поставить себя в выигрышное положение',
            'Напрягаю все силы для борьбы с проблемой',
            'Стараюсь исключить из зоны влияния того, кто мешает решению проблемы',
            'Управляю ресурсами и людьми для решения проблемы',
            'Оставляю всё, чтобы само разрушилось и можно было строить заново'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 2: Как вы относитесь к финансовым вопросам?',
        'options': [
            'Я обращаюсь за советом или помощью к тем, кто больше разбирается',
            'Деньги для меня не главная цель, скорее средство для путешествий и новых впечатлений',
            'Слежу за своими финансами, но не прочь немного рискнуть, играя на бирже, например',
            'Применяю свои навыки и связи для улучшения финансового положения',
            'Я зарабатываю честно и тяжело, чтобы быть независимой',
            'Не стесняюсь получать деньги любым доступным способом',
            'Веду бюджет и контролирую расходы и доходы строго',
            'Ничего не делаю, если не получаю от этого явной выгоды'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 3: Как бы вы провели выходные?',
        'options': [
            'С радостью поеду с друзьями на дачу или за границу, одному скучно',
            'Путешествую в неизвестное место, исследую новые направления',
            'Устраиваю вечеринку с элементами неожиданных сюрпризов',
            'Пойду на тренинг по манипуляциям, НЛП, ораторское искусство, чтобы завести новые отношения или выгодные знакомства, или в бар, ночной клуб',
            'Участвую в спортивных или боевых соревнованиях',
            'Обдумываю, как можно увеличить свое влияние и/или пространство вокруг',
            'Провожу инвентаризацию дома или собираю семейный праздничный стол для родни, друзей',
            'Отправляюсь к близким,, чтобы помочь им - они без меня не справятся'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 4: Как вы относитесь к изменениям в жизни?',
        'options': [
            'Предпочитаю веселые приключения, это круто если я знаю, что делать, по-другому боязно',
            'Изменения вдохновляют, люблю экспериментировать с новым образом жизни',
            'Быстро адаптируюсь, использую изменившуюся ситуацию для своей пользы',
            'Воспринимаю изменения как шанс усилить свои позиции',
            'Изменения – вызов, который я готов принять',
            'Я переношу изменения, когда это в мою пользу или если могу отомстить кое-кому',
            'Изменения – это просто еще одно событие, которое я контролирую',
            'Все изменения считаю естественным ходом вещей'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 5: Как вы разрабатываете новые идеи?',
        'options': [
            'Опираюсь на коллективное мнение и советы более опытных людей',
            'Бродя по местам, которые меня вдохновляют, собираю идеи',
            'Иногда новые идеи просто витают в воздухе, я их подхватываю',
            'Использую секретные методы для обобщения идей',
            'Пробую разные подходы и не сдаюсь, пока не использую все',
            'Раскрываю слабые стороны чужих идей, чтобы сделать свои лучше',
            'Планирую всю работу и документооборот для лучшего выполнения',
            'Оставляю идеи в покое, пока они не станут понятными сами по себе'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 6: Какую роль вы выбираете в групповой работе?',
        'options': [
            'Люблю работать в команде с хорошими людьми',
            'Предпочитаю оставаться в стороне, наслаждаясь тем, как другие работают',
            'Включаюсь, добавляя неожиданные повороты',
            'Стремлюсь контролировать всех и незаметно это делая',
            'Вожака, направляющего людей в бой',
            'Того, кто решает, какие идеи плохие и выметает их',
            'Координатора, организующего встречу',
            'Нейтрального наблюдателя, разбрасывающего взгляды'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 7: Как вы справляетесь со стрессом?',
        'options': [
            'Мне сложно контролировать эмоции, часто переживаю по пустякам',
            'Отвлекаюсь на путешествия или природу для расслабления',
            'Юмор и личная жизнь (когда меня любят) помогают мне справиться с трудностями',
            'Воспользуюсь ситуацией для получения выгоды',
            'Бросаюсь решать проблему, не теряя ни минуты',
            'Стараюсь устранить источник стресса',
            'Применяю практики медитации, играю в шахматы или иду на тренировку, что-то подобное, чтобы все обдумать',
            'Надеюсь, что ситуация разрешится сама собой'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 8: На каких ценностях строятся ваши отношения?',
        'options': [
            'Доверие и сотрудничество – ключ к крепким отношениям',
            'Свобода и приключения – главные ценности в отношениях',
            'Удовольствие и секс всегда ставлю на первое место',
            'Контроль и управление помогают мне держать все под контролем',
            'Честность и уважение – основа любого союза',
            'Я строю отношения по своим правилам – это всегда хорошо работает',
            'Порядок и стабильность лежат в основе связи',
            'Жизнь не для радости, а для совести, живи ради других, я не даю отношениям властвовать'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 9: Как вы мотивируете себя на достижение целей?',
        'options': [
            'Думаю о том, чего хочу, равняюсь на тех - кто этого достиг',
            'Вдохновляясь путешествиями и новыми впечатлениями',
            'Превращая работу в игру',
            'Предоставляя себе больше возможностей через посредничество',
            'Фокусируясь на упорном труде и целеустремленности',
            'Постоянно пытаясь быть на шаг впереди всех',
            'Выполняя конкретные задачи по строгому расписанию',
            'Позволяя событиям и людям побудить к действиям'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
    {
        'text': 'Вопрос 10: Как управляетесь с конфронтацией?',
        'options': [
            'Ищу того, кто меня защитит или поддержит',
            'Обхожу конфликт стороной',
            'Использую юмор и свое природное обаяние, чтобы снизить напряжение',
            'Проверяю все свои ресурсы и связи, чтобы выиграть',
            'Стою на своем с силой и стойкостью',
            'Подавляю сопротивление, не давая подняться',
            'Составляю стратегию управления конфликтом',
            'Остаюсь сторонним наблюдателем'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    },
        {
        'text': 'Вопрос 11: Как вы предпочитаете отдыхать после долгого дня?',
        'options': [
            'Играю в компьютерные игры и т п, чтобы расслабиться в спокойной атмосфере',
            'Люблю сорваться куда-то со своими на свежий воздух',
            'Мне помогают восхищение и любовь, пойду на свидание',
            'Расслабляюсь, просматривая немного обучающего видео или работая над хобби, приносящими скрытую пользу',
            'Занимаюсь спортом, чтобы сбросить испытания дня',
            'Сажусь в одиночку, чтобы подумать о дне',
            'Пользуюсь ароматерапией или книгой в теплой ванне',
            'Остаюсь на диване, наслаждаясь сериалом'
        ],
        'archetypes': [
            'Принц/Принцесса',
            'Бродяга/Дрянная девчонка',
            'Трикстер/Жрица',
            'Черный маг/Ведьма',
            'Герой/Амазонка',
            'Злодей/Охотница',
            'Хозяин/Хозяйка',
            'Людоед/Ужасная Мать'
        ]
    }
]
